#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
aws_acm_certificate.pub_acm_cert: Refreshing state... [id=arn:aws:acm:us-east-1:161444948461:certificate/ca905f14-6e5f-4969-92d9-9bcc56789321]
aws_cloudfront_origin_access_identity.pub_origin_access_identity: Refreshing state... [id=EFVXTJMSPUTAJ]
aws_s3_bucket_public_access_block.pub_s3_bucket_pub_policy: Refreshing state... [id=lastlocalcase.sg]
aws_iam_role.pub_last_lambda_inv_exec: Refreshing state... [id=public-last-inv-policy-20210327112906936800000002]
aws_iam_role.iam_for_lambda: Refreshing state... [id=pub_lastlocal_lambda_invalidation_role]
aws_s3_bucket_object.pub_repo_html["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_object.pub_repo_html["index.dev.html"]: Refreshing state... [id=index.dev.html]
aws_iam_role.pub_lambda_execution: Refreshing state... [id=pub-last-lambda-policy-20210327112906936400000001]
aws_kms_key.credentialbucketkey: Refreshing state... [id=6f7bae89-6f6b-42e9-8189-4654b315126f]
aws_s3_bucket.pub_s3_bucket: Refreshing state... [id=lastlocalcase.sg]
aws_s3_bucket.terraform_artifact_bucket: Refreshing state... [id=sg-lastlocalcase-artifact-bucket]
aws_iam_role_policy.pub_lambda_invalidation_execution: Refreshing state... [id=public-last-inv-policy-20210327112906936800000002:public-invalidation-policy-20210327112911590900000003]
aws_lambda_function.pub_s3_invalidation: Refreshing state... [id=public_lastlocal_invalidation]
aws_iam_role_policy.pub_lambda_execution: Refreshing state... [id=pub-last-lambda-policy-20210327112906936400000001:pub-last-lambda-policy-20210327112911683900000004]
aws_lambda_function.pub_folder_index_redirect: Refreshing state... [id=pub-last-index-redirect]
aws_route53_record.pub_cert_validation: Refreshing state... [id=Z00563891EDJS4V1EERXS__3a7894d230589c3c6b3e2ca56b6488ce.lastlocalcase.sg._CNAME]
aws_cloudfront_distribution.pub_s3_distribution: Refreshing state... [id=E3INA79U1U2Q7W]
aws_lambda_permission.allow_bucket: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=lastlocalcase.sg]
aws_route53_record.pub_route53_record: Refreshing state... [id=Z00563891EDJS4V1EERXS_lastlocalcase.sg_A]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.every_one_hour will be created
  + resource "aws_cloudwatch_event_rule" "every_one_hour" {
      + arn                 = (known after apply)
      + description         = "Fires every one hour"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-one-hour"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 hour)"
    }

  # aws_cloudwatch_event_target.check_covid_every_one_hour will be created
  + resource "aws_cloudwatch_event_target" "check_covid_every_one_hour" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-one-hour"
      + target_id      = "lambda"
    }

  # aws_iam_role.pub_lambda_covid will be created
  + resource "aws_iam_role" "pub_lambda_covid" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "lambda.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Managed by Terraform"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "pub-lambda-covid-policy-"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.pub_lambda_covid will be created
  + resource "aws_iam_role_policy" "pub_lambda_covid" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "pub-lambda-covid-policy-"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_lambda_function.pub_covid_scraper will be created
  + resource "aws_lambda_function" "pub_covid_scraper" {
      + arn                            = (known after apply)
      + description                    = "Managed by Terraform"
      + filename                       = "./covid_scraper.py.zip"
      + function_name                  = "covid_scraper"
      + handler                        = "covid_scraper.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "9LVUaW8Pp6p39aDcyT6Kmbt7ACWdSLwjxsYD8nLwBWY="
      + source_code_size               = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.allow_cloudwatch_to_call_check_covid will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_check_covid" {
      + action        = "lambda:InvokeFunction"
      + function_name = "covid_scraper"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_lambda_permission.allow_covid_bucket will be created
  + resource "aws_lambda_permission" "allow_covid_bucket" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "s3.amazonaws.com"
      + source_arn    = "arn:aws:s3:::lastlocalcase.sg"
      + statement_id  = "AllowExecutionFromS3Bucket"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfapply

To perform exactly these actions, run the following command to apply:
    terraform apply "tfapply"

```
</details>
*Pusher: @artagel, Action: `pull_request`*